In [1]:
# import Library Pandas
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(1256848966)

In [2]:
hedars = ['Naem', 'Aeg', 'Dp']
values = ['Khaled Nada', 19, 'MM']
my_ser = pd.Series(data = values, index = hedars)

In [3]:
print(my_ser)

Naem    Khaled Nada
Aeg              19
Dp               MM
dtype: object

In [4]:
my_ser['Naem']

'Khaled Nada'

In [5]:
my_second_ser = pd.Series(values) #inexd values 
my_index = pd.Series(hedars) 
my_second_ser

0    Khaled Nada
1             19
2             MM
dtype: object

In [6]:
my_index

0    Naem
1     Aeg
2      Dp
dtype: object

In [7]:
s = pd.Series([1,3,5,'np.nan',6,8]) #(Series) in pandas integr index
print(s)

0         1
1         3
2         5
3    np.nan
4         6
5         8
dtype: object

In [8]:
std_iug = pd.Series(data = ['120180163', '120180162'], index = ['khaled nada', 'abood'])
std_iug1 = pd.Series(data = ['120180169', '120180163'], index = ['alaa', 'khaled nada'])
std_iug + '  ' + std_iug1

abood                           NaN
alaa                            NaN
khaled nada    120180163  120180163
dtype: object

In [9]:
dates = pd.date_range('20130101', periods = 6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4),index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.625270 -0.303948 -1.065097  0.473648
2013-01-02  0.377705  0.361903  2.047350  0.546875
2013-01-03  0.967142  0.177541  0.774779 -0.375984
2013-01-04 -1.135310 -0.529891 -0.764009 -1.721481
2013-01-05  0.053170  2.196709 -0.641217 -0.472389
2013-01-06 -0.334030  0.233338  0.746351 -1.430246

In [11]:
# open or read fiel csv in pandas
df1 = pd.read_csv('my_iris.csv')
df1.head() # prin headr df /// default 5
# print(df1[:6])

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [12]:
# check the bottom 10 rows of data frame "df"
df1.tail(15)
df1.shape

(150, 5)

# Data Frame

In [13]:
df_1 = pd.DataFrame(1, index = ['Z', 'Y', 'X'], columns = ['Num1', 'Num2', 'Num3'] )
df_1

   Num1  Num2  Num3
Z     1     1     1
Y     1     1     1
X     1     1     1

In [14]:
df_1.reset_index()

  index  Num1  Num2  Num3
0     Z     1     1     1
1     Y     1     1     1
2     X     1     1     1

In [15]:
my_df = pd.DataFrame(randn(4, 4), index = ['A', 'S', 'D', 'F'], columns = ['A1', 'A2', 'A3', 'A4'])
my_df

         A1        A2        A3        A4
A -0.453818 -2.083707 -0.457078  0.606460
S -0.865463  1.251384  0.346019  0.967218
D  0.168995  1.190392  1.401169  0.320294
F  0.365929  1.491865 -0.905144 -1.506900

In [16]:
my_df['A1'] # Oen columns

A   -0.453818
S   -0.865463
D    0.168995
F    0.365929
Name: A1, dtype: float64

In [17]:
my_df[['A2', 'A4']] # Tow columns

         A2        A4
A -2.083707  0.606460
S  1.251384  0.967218
D  1.190392  0.320294
F  1.491865 -1.506900

In [18]:
# Add columns
my_df['A1 + A4'] = my_df['A1'] + my_df['A3']
my_df

         A1        A2        A3        A4   A1 + A4
A -0.453818 -2.083707 -0.457078  0.606460 -0.910896
S -0.865463  1.251384  0.346019  0.967218 -0.519445
D  0.168995  1.190392  1.401169  0.320294  1.570163
F  0.365929  1.491865 -0.905144 -1.506900 -0.539215

In [19]:
# Rows
my_df.loc['D'] # لما بدي اجيب row  بضع loc

A1         0.168995
A2         1.190392
A3         1.401169
A4         0.320294
A1 + A4    1.570163
Name: D, dtype: float64

In [20]:
my_df.iloc[2] # لما بدي اجيب الرو بي بحط i index

A1         0.168995
A2         1.190392
A3         1.401169
A4         0.320294
A1 + A4    1.570163
Name: D, dtype: float64

In [21]:
my_df.loc[['S', 'F']]

         A1        A2        A3        A4   A1 + A4
S -0.865463  1.251384  0.346019  0.967218 -0.519445
F  0.365929  1.491865 -0.905144 -1.506900 -0.539215

In [22]:
my_df.loc[['S', 'F'], ['A3', 'A4']]

         A3        A4
S  0.346019  0.967218
F -0.905144 -1.506900

In [23]:
my_df.loc['S', 'A2'] # print vulas

1.2513837623143191

In [24]:
my_df

         A1        A2        A3        A4   A1 + A4
A -0.453818 -2.083707 -0.457078  0.606460 -0.910896
S -0.865463  1.251384  0.346019  0.967218 -0.519445
D  0.168995  1.190392  1.401169  0.320294  1.570163
F  0.365929  1.491865 -0.905144 -1.506900 -0.539215

In [25]:
my_df.drop('A1 + A4', axis = 1)

         A1        A2        A3        A4
A -0.453818 -2.083707 -0.457078  0.606460
S -0.865463  1.251384  0.346019  0.967218
D  0.168995  1.190392  1.401169  0.320294
F  0.365929  1.491865 -0.905144 -1.506900

In [26]:
my_df

         A1        A2        A3        A4   A1 + A4
A -0.453818 -2.083707 -0.457078  0.606460 -0.910896
S -0.865463  1.251384  0.346019  0.967218 -0.519445
D  0.168995  1.190392  1.401169  0.320294  1.570163
F  0.365929  1.491865 -0.905144 -1.506900 -0.539215

In [27]:
my_df.drop('A3', axis=1, inplace=True)
my_df

         A1        A2        A4   A1 + A4
A -0.453818 -2.083707  0.606460 -0.910896
S -0.865463  1.251384  0.967218 -0.519445
D  0.168995  1.190392  0.320294  1.570163
F  0.365929  1.491865 -1.506900 -0.539215

In [28]:
my_df.drop('F', axis=0, inplace=True)

In [29]:
my_df

         A1        A2        A4   A1 + A4
A -0.453818 -2.083707  0.606460 -0.910896
S -0.865463  1.251384  0.967218 -0.519445
D  0.168995  1.190392  0.320294  1.570163

In [33]:
my_df.drop(['A4', 'A1 + A4'], axis=1, inplace=True)
my_df

         A1        A2
A -0.453818 -2.083707
S -0.865463  1.251384
D  0.168995  1.190392

# END